["Determined teen Din is longing to reconnect with his childhood best friend when he meets a wish-granting dragon who shows him the magic of possibilities.", "Early 1700: Cartographer Jonathan Green (Jason Flemyng) from Viy (2014) is back to map the Russian Far East. He's forced on to China, where he confronts the Dragon Master et al. The iron masked Russian Czar escapes the Tower of London to a Russian ship.", "A legendary demon hunter (Jackie Chan), tracking down beasts that enter the human dimension, assisted by a lawman protégé and a motley group of friendly monsters.", "A group of mercenaries come together to pull of an epic heist.", "A UFC fighter's world is turned upside down when he discovers an elite group of world-renowned athletes and scientists who prove that everything he had been taught about protein was a lie.", "A Special Forces Agent is assigned to protect a scientist and his creation from a sinister gang.", "A humble businessman with a buried past seeks justice when his daughter is killed in an act of terrorism. A cat-and-mouse conflict ensues with a government official, whose past may hold clues to the killers' identities.", "When her son is kidnapped, the inventor of a time machine teams up with multiple versions of her future self to rescue him.", "Two professors team up to locate a lost treasure and embark on an adventure that takes them from a Tibetan ice cave to Dubai, and to a mountain temple in India.", "A railroad worker in China in 1941 leads a team of freedom fighters against the Japanese in order to get food for the poor.", "A detective from Hong Kong teams up with an American gambler to battle against a notorious Chinese criminal.", "A reporter becomes involved with a mysterious woman while investigating her late husband's death.", "Having fallen into amnesia 'Who Am I' is forced to fight for his life while searching for answers.", "A look at the use and proliferation of illegal wildlife products throughout the world.", "When corrupt Roman leader Tiberius arrives with a giant army to claim the Silk Road, Huo An teams up his army with an elite Legion of defected Roman soldiers led by General Lucius to protect his country and his new friends.", "", "A man searches the world for a set of mystic artifacts. The twelve bronze heads of the animals from the Chinese zodiac.", "In early 11th century China, the Song Dynasty is being invaded by armies of the rival state Western Xia. Yang, the last of a long line of Song generals, is killed and his widowed wife Mu leads other widows into battle to save their dynasty.", "An old soldier kidnaps a young General of an enemy state and takes him on a long journey to collect the reward.", "A simple Chinese immigrant wages a perilous war against one of the most powerful criminal organizations on the planet.", "Ten years ago, five students joined a martial arts school and learned the disciplines of Wushu and the bonds of friendship. Today, both will be put to the test after they and a former student stumble into a child kidnapping ring.", "A father desperately tries to hide his Triad lifestyle from his daughter.", "Thongs and Octopus accept a job from their landlord: kidnap a baby. Soon, the baby awakens strong paternal feelings in the two crooks, leading to complications when it comes to handing him over to his possibly crazy gang boss grandfather.", "Archeologist Jack keeps having reoccurring dreams of a past life, where he is the great general Meng Yi, who is sworn to protect a princess named Ok-Soo. Jack decides to go investigate everything with his friend William.", "A person's life is destined to be shorter than that of a city. Having spent her whole life in Shanghai, Qiyao has her moments of prosperity and her fair share of loneliness. She finally fades and disappears but Shanghai remains a metropolitan city. Shanghai in the 1930s is glamor... Read all", "A former secret agent's past catches up to him, and his two children have to rescue him before it's too late.", "Fearing her son could be gay, a conservative mother takes in a French foreign exchange student, who ends up teaching the family a lot about life, acceptance, and love.", "A hero cop accidentally leads his team into a trap from which he is the only survivor. Drowning his guilt in booze, he is eventually assigned a new younger partner who turns out to have his own secrets.", "To win a bet, an eccentric British inventor embarks, with his Chinese valet and an aspiring French artist, on a trip full of adventures and dangers around the world in exactly 80 days.", "Hong Kong’s top triad leader Hung appoints his gay son Georgie to be his successor before he dies. But Hung’s loyal right-hand man Cheung mistakes his roommate Sam as Georgie instead.", "A Hong Kong detective suffers a fatal accident involving a mysterious medallion and is transformed into an immortal warrior with superhuman powers.", "When a Chinese rebel murders Chon's estranged father and escapes to England, Chon and Roy make their way to London with revenge on their minds.", "At a Hong Kong shopping center, Buck Yuen's (Jackie Chan's) intuition warns him. He saves a robbery's loot and gets on television, ends up in Istanbul via South Korea, and accidentally becomes a spy. Fortunately, he knows Kung Fu.", "A Chinese man travels to the Wild West to rescue a kidnapped Princess. After teaming up with a train robber, the unlikely duo takes on a Chinese traitor and his corrupt boss.", "A ridiculed HK cop hires 3 cadets, directly (thrown) out of police academy, to go undercover and get the criminals, who stole explosives and killed his partner.", "A romantic girl travels to Hong Kong in search of certain love but instead meets a kind-hearted professional fighter for whom she begins to fall instead.", "Three friends who grew up from the same orphanage and became scientists, now research human subconscious at CIA. They get the news that a criminal named \"Mad Dragon\" plans to send violence mind to Asia maliciously to unleash financial crisis. Both sides try their best to defeat t... Read all", "A drug lord under arrested threatens the judges and the police. Meanwhile an undercover cop approaches the drug lord's girl to collect evidences.", "In order to release his kidnapped sister, sports car mechanic Chan Foh To (Jackie Chan) has to beat a supercriminal street racer.", "", "A Hong Kong detective teams up with his female Red Chinese counterpart to stop a Chinese drug czar.", "An armored car with two million dollars worth of banknotes on board is hijacked at Hong Kong's international airport by a gang of four - three men and a girl. It is one of the best orchestrated heists in memory. Bombs and guns are used to stop the car and disarm the guards. A jee... Read all", "Biopic of 1930s Chinese actress Lingyu Ruan.", "A man returning to his old neighborhood after a prison term finds that the friends he used to hang out with are now a violent street gang that is terrorizing the community.", "The story takes place in the 1960s, where three street hooligans, Peng, Qiang, and Wei, got to know each other due to a misunderstanding and became sworn brothers with different surnames. Later, Peng joined the police force, and Qiang and Wei, in order to help their friends achie... Read all", "", "Four new Banshee Squad Members join the Hong Kong Police Academy to undergo training supervised by Madam Wu (Sibelle Hu). Their personalities don't click with the current Squad Members, resulting in petty arguments and duels. However, they later make peace with one another as the... Read all", "Madame Wu (Sibelle Hu) has been assigned to the Hong Kong Police Academy to train female Banshee Squad Members, next door to the male Tiger Squad Members lead by Inspector Kan (Shui-Fan Fung). After internal conflicts and courting mishaps, the squad members were ordered to band t... Read all", "Fleur is the blue angel in one of Hong Kong's \"flower houses\" - bordellos and night clubs of the 1930s. A detached and beautiful performer, she falls in love with Twelfth Master Chan, heir to a chain of pharmacies. They agree to a suicide pact. 50 years later, in modern Hong Kong... Read all", "", "Sing is an ex-con who's supposed to dig up the buried loot of his three still-jailed buddies, but when he gets to it, he finds that the treasure chest is full of rocks. The other three are convinced that Sing stole the goods for himself.", "", ""]